SoildFaker/stm32-prjs/stm32-parking/drivers/tools.c
#include "tools.h"
#include "stm32f10x_usart.h"
#include "stm32f10x.h"
#include "conf.h"
#include <stdarg.h>  

static uint8_t  fac_us=0;//us延时倍乘数
static uint16_t fac_ms=0;//ms延时倍乘数
float height = 0.0f;
va_list args;  
  
char sign[] = { '0','1','2','3','4','5',  
                '6','7','8','9','a','b',  
                'c','d','e','f'};  
 
void UserInit(void)
{
  RCC_Conf();
  GPIO_Conf();
  TIMER_Conf();
  PWM_Conf();
  USART_Conf();
  /*I2C_Conf();*/
  NVIC_Conf();

  DelayInit(72);
}
 
void PWM_Init(void)
{
  TIM4->CCR1=0;
  TIM4->CCR2=0;
  TIM4->CCR3=0;
  TIM4->CCR4=0;
}

void print_int(int num, int mode, int flag)  
{  
  if(num == 0){  
    if(flag == 0){  
      UsartPut('0');  
      return;  
    }else{  
      return;  
    }  
  }  
  
  print_int(num/mode, mode, 1);  
  UsartPut(sign[ num%mode ]);  
}  
  
void print_str(char const *str)  
{  
  if(str == NULL)  
  {  
    return;  
  }  
  
  while(*str != '\0')  
  {  
    UsartPut(*str);  
    str++;  
  }  
}  
  
  
void print_float(float num)  
{  
  int part = (int)num/1;  
  
  print_int(part, 10, 0);  
  UsartPut('.');  
  part=num*1000000-part*1000000;  
  print_int(part, 10, 0);  
}  
 
// 向串口发送一个字节的数据，配合printf使用
uint8_t UsartPut(uint8_t ch)
{
	USART_SendData(USART2, (uint8_t) ch);
	//Loop until the end of transmission
	while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET) {
	}
  return ch;
}

// 从串口接受数据
uint8_t UsartGet(void)
{
	while (USART_GetFlagStatus(USART2, USART_FLAG_RXNE) == RESET);
	return (uint8_t)USART_ReceiveData(USART2);
}

 
void check_type(char type)  
{  
  switch(type)
  {  
    case 'd':
    {  
      int num = va_arg(args, int);  
  
      if(num < 0){  
        UsartPut('-');  
        num = num * (-1);  
      }  
  
      print_int(num, 10, 0);  
      break;  
    }  
  
    case 'c':
    {  
      char ch = (char)va_arg(args, int);  
      UsartPut(ch);  
      break;  
    }  
    
    case 's':
    {  
      char *str = va_arg(args, char *);  
      print_str(str);  
      break;  
    }  
    
    case 'f':
    {  
      float num = (float)va_arg(args, double);  
    
      if(num < 0)  {  
        UsartPut('-');  
        num = num * (-1);  
      }  
    
      print_float(num);  
      break;  
    }  
    
    case 'p':
    {  
      int num = va_arg(args, int);  
      UsartPut('0');  
      UsartPut('x');  
      print_int(num, 16, 0);  
      break;  
    }  
    
    default:
    {  
      UsartPut('%');  
      UsartPut(type);  
    }  
  }  
}  
  
void myprintf(const char *format, ...)  
{  
  if(format == NULL){  
    return;  
  }  
    
  va_start(args, format);  
    
  while(*format != '\0'){  
    while(*format != '%' && *format != '\0'){  
      UsartPut(*format);  
      format++;         
    }  
  
    if(*format != '\0'){  
      format++;  
      if(*format != '\0'){  
        check_type(*format);  
        format++;  
      }else{  
        UsartPut(*(format-1));  
      }  
    }  
  }  
  
  va_end(args);  
}  

//初始化延迟函数
void DelayInit(uint8_t SYSCLK)
{ 
  fac_us=SYSCLK/8;		//不论是否使用ucos,fac_us都需要使用
	fac_ms=(uint16_t)fac_us*1000;//非ucos下,代表每个ms需要的systick时钟数
}

int get_tick_count(uint32_t *count)
{
  count[0] = SysTick->CTRL;
	return 0;
}

//延时nus
//nus为要延时的us数.
void delay_us(uint32_t nus)
{
	uint32_t temp;
	SysTick->LOAD=nus*fac_us; //时间加载
	SysTick->VAL=0x00;    //清空计数器
	SysTick->CTRL=0x01 ;    //开始倒数
	do {
		temp=SysTick->CTRL;
	}
	while((temp&0x01)&&!(temp&(1<<16)));//等待时间到达
	SysTick->CTRL=0x00;     //关闭计数器
	SysTick->VAL =0X00;     //清空计数器
}

//延时nms
void delay_ms(uint16_t nms)
{
	uint32_t temp;
	SysTick->LOAD=(uint32_t)nms*fac_ms;//时间加载(SysTick->LOAD为24bit)
  SysTick->VAL=0x00;    //清空计数器
	SysTick->CTRL=0x01 ;    //开始倒数
	do {
		temp=SysTick->CTRL;
	}
	while((temp&0x01)&&!(temp&(1<<16)));//等待时间到达
	SysTick->CTRL=0x00;     //关闭计数器
	SysTick->VAL =0x00;       //清空计数器
}
